Documents/Письмо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>Письмо</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПисьма</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидПисьма</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицоОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>90</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПисьма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокЛичныхДел</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛичноеДело</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЛичноеДело</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>90</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Приложение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЛичноеДело</v8:Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:DocumentRef.Письмо</v8:Type>
								<v8:Type>cfg:CatalogRef.СельскиеСоветы</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:DocumentRef.Решение</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст1</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст3</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст4</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Письмо/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТекстПисьма(Команда)
	ПараметрыФормы = Новый Структура("ОбъектПечати,ШаблонОбъекта");   
	ПараметрыФормы.Вставить("ОбъектПечати", Объект.Ссылка);
	ПараметрыФормы.Вставить("ШаблонОбъекта",Объект.ШаблонПисьма);
	ОткрытьФорму("ОбщаяФорма.ФормаРедактированияТекстаОбъекта",ПараметрыФормы,ЭтаФорма);
КонецПроцедуры
&НаСервере
Функция ПолучитьЗаявителяСтрока(ЛД)
	
	Возврат ЛД.Заявитель.Наименование;
КонецФункции
&НаСервере
Функция КоличествоЛистовПредоставленныхДокументов(Док)
	Возврат Док.СписокДокументовПредоставлено.Итог("КоличествоЛистов");
КонецФункции	

&НаКлиенте
Процедура ЗаполнениеТаблицыПриложение(ТД)
	Если ТипЗнч(ТД.ЛичноеДело)  = Тип("ДокументСсылка.ЛичноеДело") Тогда
		ОписаниеТипов = Новый ОписаниеТипов("ДокументСсылка.ЛичноеДело"); 
		ОписаниеТиповТекст2 = Новый ОписаниеТипов("Число");
		Элементы.ПриложениеТекст1.Заголовок = "Наименование приложения";
		Элементы.ПриложениеТекст2.Заголовок = "Физическое лицо";
		Элементы.ПриложениеТекст3.Заголовок = "Количество листов";
		Элементы.ПриложениеТекст4.Заголовок = "Количество экземпляров";
		НаименованиеПриложения = "Дело";
		
	Иначе	
		ОписаниеТипов = Новый ОписаниеТипов("Строка"); 
	КонецЕсли;
	НоваяСтрока = Объект.Приложение.Добавить();
	НоваяСтрока.Объект = ОписаниеТипов.ПривестиЗначение(НоваяСтрока.Объект);
	НоваяСтрока.Объект = ТД.ЛичноеДело;
	НоваяСтрока.Текст1 = НаименованиеПриложения;
	НоваяСтрока.Текст2 = ПолучитьЗаявителяСтрока(ТД.ЛичноеДело);
	КЛПД = КоличествоЛистовПредоставленныхДокументов(ТД.ЛичноеДело);
	Если КЛПД > 0 Тогда 
		НоваяСтрока.Текст3 =  ОписаниеТиповТекст2.ПривестиЗначение(НоваяСтрока.Текст1);
		НоваяСтрока.Текст4 =  ОписаниеТиповТекст2.ПривестиЗначение(НоваяСтрока.Текст2);
		НоваяСтрока.Текст3 = КЛПД;
		НоваяСтрока.Текст4 = 1;
	КонецЕсли;	
КонецПроцедуры  	
&НаКлиенте
Процедура СписокЛичныхДелЛичноеДелоПриИзменении(Элемент)
	ТД = Элементы.СписокЛичныхДел.ТекущиеДанные;
	ТД.ФизическоеЛицо  = ПолучитьЗаявителяСтрока(ТД.ЛичноеДело);
	Если ЗаполнитьТаблицуПриложения Тогда
		ЗаполнениеТаблицыПриложение(ТД);
	КонецЕсли;	
КонецПроцедуры
